import json
import re
from Levenshtein import distance

with open("config_tmp.json", "r") as json_file:
    tmp1conf = json.load(json_file)

datere = "^((?:0?[1-9]|[12][0-9]|3[01])(-|\\.|\\/))?(?:0?[1-9]|1[0-2])(-|\\.|\\/)(?:(19)?9[0-9]|(20)?([01][1-9]|10)|(20)?2[0-5])$"
def findedate(data):
    if "easy" in data:
        date = data["easy"]
        match = re.search(datere, date)
        if match:
            return data["easy"]
        nda = []
        da = date.split(".")
        for d in da:
            if len(d) <= 2:
                if len(d) == 2:
                    if d[0] == "9":
                        d = "0"+d[1]
                    elif d[0] == "8":
                        d = "3"+d[1]
                    elif d[0] == "7":
                        d = "1"+d[1]
                nda.append(d)
            elif len(d) == 4:
                d1 = d[:2]
                d2 = d[-2:]
                if len(d1) == 2:
                    if d1[0] == "9":
                        d1 = "0"+d1[1]
                    elif d1[0] == "8":
                        d1 = "3"+d1[1]
                    elif d1[0] == "7":
                        d1 = "1"+d1[1]
                if len(d2) == 2:
                    if d2[0] == "9":
                        d2 = "0"+d2[1]
                    elif d2[0] == "8":
                        d2 = "3"+d2[1]
                    elif d2[0] == "7":
                        d2 = "1"+d2[1]
                nda.append(d1)
                nda.append(d2)
        date = ".".join(nda)
        match = re.search(datere, date)
        if match:
            return date
        else:
            return ""
    else:
        return ""


piosn = """„А 000 "ПИ ОСН” 3 ф & 2г. Москёва #ч А
000 "НИ ОСН 1 г. Москёа
000 "НИ ОСН 1 г. Москёа
000 "НИ ОСН 1 г. Москёа
000 "НИ ОСН
„Аа | ды °а 1  == П'т 000 «ПИ ОСН» г. МоскВа ОПсиляат А Я
000 "НИ ОСН 1 г. Москёа
000 "НИ ОСН 1 # ^& т г. Москёа
ООО „А. "ПИ ОСН" 1".&"п / г. Москва
`1 # ^& па 7 ООО «ПИ ОСН» /
ООО "ПИ ОСН" г. Москва
000 "ПИ ОСН” „А 3 ф & #ч А 2г. Москёва
`1 # ^& па 7 ООО «ПИ ОСН» /
`1 # ^& па 7 ООО «ПИ ОСН» /
„А 000 "ПИ ОСН” 3 ф & 2г. Москёва #ч А
`1 # ^& па 7 ООО «ПИ ОСН» /
000 «ПИ ОСН» г.Москёва
`1 # ^& па 7 ООО «ПИ ОСН» /
000 "ПИ ОЕН” ал 3 ф ^ п 2г. Москва
`1 # ^& па 7 ООО «ПИ ОСН» /
‘Д’ 000 «ПНИ ОСН» 13 лт СУ У
» 7 ' `Ф — ООО «ПИ ОСН» '1 # ’ЁЁ“ л ЛА
`1 # ^& па 7 ООО «ПИ ОСН» /
000 "ПИ ОСН „А. З.ЁЁ'п 2г. Москёа
`1 # ^& па 7 ООО «ПИ ОСН» /
000 "ПИ ОСН „А. ііі'ёп 2г. Москёа
000 "ПИ ОСН” Фопмот А
000 "НИ ОСН „А. 1 # ^ пп у ох г. Москёа
000 “НИ ОСН „А 1 # ^ - 2г. МоскВа боау”
000 "ПИ ОСН „А. 3.%2: 2г. Москёа
А. і.’і\ 000 «ПИ ОСН»
ч` 000 "ПИ ОСН" А. 1 # ^г г. Москва
..Д‚ 000 «ПИ ОСН» 3 # ^ пи
000 "ПИ ОСН""".split("\n")

vnipi = """ПАО «ВНИПИгаздобыча» Фотмат А4.
«, ПАО «ВНИПИгаздобыча»
ПАО «ВНИПИгаздобыча» Фотмат А4.
«, ПАО «ВНИПИгаздобыча»
«, ПАО «ВНИПИгаздобыча»
«». ПАО «ВНИПИгаздобыча»
«, ПАО «ВНИПИгаздобыча»
«, ПАО «ВНИПИгаздобыча»
ПАО «ВНИПИгаздобыча» тПі'\\д"д’Г' А А
ПАО «ВНИПИгаздобыча» тПі'\\д"Д’Г А А
ПАО «ВНИПИгаздобыча» Фотмат А
ПАО «ВНИПИгаздобыча» тПі'\\д"д’Г' А А
ПАО «ВНИПИгаздобыча» тПі'\\д"Л’Г' А А
ПАО «ВНИПИгаздобыча» тПі'\\д"Д’Г А А
ПАО «ВНИПИгаздобыча» Фотмат А4
ПАО «ВНИПИгаздобыча» Фотмат А
ПАО «ВНИПИгаздобыча» тПі'\\д"Д’Г А А
ПАО «ВНИПИгаздобыча» тПі'\\д"Д’Г А А
ПАО «ВНИПИгаздобыча» тПі'\\д"д’Г' А А
ПАО «ВНИПИгаздобыча» тПі'\\д"д’Г' А А
ПАО «ВНИПИгаздобыча» лат АЛ
ПАО «ВНИПИгаздобыча» тПі'\\д"Л’Г' А А
ПАО «ВНИПИгаздобыча» улимлат АЛ
ПАО «ВНИПИгаздобыча» улимлат АЛ
ПАО «ВНИПИгаздобыча» улимлат АЛ
ПАО «ВНИПИгаздобыча» улимлат АЛ""".split("\n")

gasprom_sar = """00 “Газпром проектуробание” Саратобскии.филчал А1
000 “Газпром проектуробание” Саротобский филнал А2
000 “Газпром проектирование” Саратобскиц фулиал А1
000 "Газпром проектиробание” Саратобскиуй филчал А2
А . А - ООО «Газпром проектирование» Саратовский филиал лу ат АЛ
ООО «Газпром проектирование» Саратовский филиал
н у” ьв 5Р ы ЧЕр в й Спецификация. ООО "Газпром проектирование" | ЁЁУТРИПЛОЩЭДОЧНЫЭ сети 0,4 Саратовский филиал
ООО "Газпром проектирование" Саратовский филиал
А + А — ООО «Газпром проектирование» Саратовский филиал Фотмат АА
ООО "Газпром проектирование" Саратовский филиал
ООО "Газпром проектирование'" Саратовский филиал
› БоваіпенкоЬс:‹ом НЕКМ. ’ | ? Общие данные ООО "Газпром просктирование' Саратовский филиал | Фотпмат А4
ООО "Газпром проектирование' Саратовский филиал""".split("\n")

gasprom = """(утАЗиРОМ
ГУ сч ол ья у
(ЯизПРОМ 11111111 “Тъ/х
.і©тзпрпм ЗНа "Формат А4
() гхЗпРОМ ПРОЕКТЕЛСНАНЯС: НГ ” ппппп
я позпРОЫ ГА АЙ тезиттал # ш…і-пмшшщ
(8уазпРОМ КККККККККККККККККККК Формат А4
ГЁЁ АЗВРОМ Га ъ
(ороолном
(ЯуГАЗИРОМ «Тч уч ь # Ра оу
(ЯегоЗИРОМ
ё%&зшята Н Г)г ат АЛ
( гОЗПРОМ
лам Фотмат А4
(РуГАЗПРОМ
(яфгпзпРом (Ог АД
т©тзпрпм Фотмат А4
збузпрон | | Э› ПРИНКТИНОВАМИР | А2
ГВ 9 | 0П\ЕП"’"М \ЭЬ"-'"' А?
п“п\зпгпм А2
РИ и 1©шзпрпм А7
Э ›П.ПШ К РОН ВНИ | А7
СВ ОЕ 1 ЬПДП ЗиИНСОн А
©гдзпрпм ч‘ ›ПДПП РИ АНИ | Форлиетт | А1КЗ
(вукатиом А З,^
/-Г ЗПРОМ |: ЪП.ПП эоланут.  Атс
.10гпзпрпм П'.П ааиаа АТх 5
тд“гдзпрпм А7
т©тзпрпм Фотмат А4т©тзпрпм Фотмат А4
збузпрон | | Э› ПРИНКТИНОВАМИР | А2
ГВ 9 | 0П\ЕП"’"М \ЭЬ"-'"' А?
п“п\зпгпм А2
РИ и 1©шзпрпм А7
Э ›П.ПШ К РОН ВНИ | А7
СВ ОЕ 1 ЬПДП ЗиИНСОн А
©гдзпрпм ч‘ ›ПДПП РИ АНИ | Форлиетт | А1КЗ
(вукатиом А З,^
/-Г ЗПРОМ |: ЪП.ПП эоланут.  Атс
.10гпзпрпм П'.П ааиаа АТх 5
тд“гдзпрпм А7
т©тзпрпм Фотмат А4
т©тзпрпм ||||||||||||||||||||| Фотмат А4
збузпрон | | Э› ПРИНКТИНОВАМИР | А2
ГВ 9 | 0П\ЕП"’"М \ЭЬ"-'"' А?
п“п\зпгпм |||||||||||||||||||| А2
РИ и 1©шзпрпм А7
Э ›П.ПШ К РОН ВНИ | А7
СВ ОЕ 1 ЬПДП ЗиИНСОн А
©гдзпрпм ч‘ ›ПДПП РИ АНИ | Форлиетт | А1КЗ
(вукатиом А З,^
/-Г ЗПРОМ |: ЪП.ПП эоланут.  Атс
.10гпзпрпм П'.П ааиаа АТх 5
тд“гдзпрпм А7
т©тзпрпм ||||||||||||||||||||| Фотмат А4""".split("\n")

gipro = """«- <©7 ГИПРОГАЗНЕНТВ
„ ((707 ГИПРОГАЗЧЕНТР
Ь о Ь онн Ь йй (©7 .'ГИПР(‚)Г АЗЦЕНТР
ЁС%г_ппрогАзцвнтр
„^ (©7 ГИПРОГАЗЧЕНТР
о (©%ГППРОГАЗЦЕНТР |
„ ай (©7 ГИПРОГАЗСЕНТР
„ ©ГППРОГАЗЦЕ1'|ТР
_(Ё%іппро'гАзЦЕнтр
(('707 ГИПРОГАЗЧЕНТР
©ГППРОГАЗЦЕНТР
— (Ё%гппрогдзцвяітр
(С%гппрогдзцентр""".split("\n")

evo = """ООО «’Эвотэк энетго »
ООО «Эвотэк энерго»""".split("\n")

aero = """ООО «АК «АэроТех»""".split("\n")

rosinauto = """б Боннний « | - | | Росунжинуринг я Автоматизация Формат _ А2
Росинжиниринг к Автоматизация Формат А&х3
| Росинжиниринг | и Автоматизация
'—=1|| Росинжиниринг 1 | Автоматизация Формат А2
о— | Росинжиниринг ||- — — Автоматизация Формат АЗ
н ‘ = ) Росинжиниринг —— Автоматизация Фиопмит АЗу 3
'—=1|| Росинжиниринг 1 | Автоматизация Формат А2
А Снинний — ‘_'| Росинжуиниринг — Автоматизация Формат АЗ
.. Росинжиниринг ЕЛ Автоматизация Формат А&х3
«. | —- | Росинжиниринг .|_ Автоматизация""".split("\n")

alfa = """АЛЬФАПРОЕКТ"""

rosin = """-лй  Росинжиниринг Плаоаект
/ — ‘° =  Росинжиниринг |__| Проект Р лк г АЭ
Росинжиниринг Т, Проект 'ормат: А&
Росинжиниринг Т, Проект 'ормат: А&
ЭГ Росинжиниринг П роек'г Формат А
вн 4 ( °„ вая Ю РЬсъ'шжиНиринг ее Проект Роомат А&х3
«н - Росинжиниринг == — Проект
Росинжиниринг = Проект Формат АЗ
—” Росинжинуринг ‘== — Проект Формат АЗх3
| Росинжуниринг |__ Фармат АЗ
А Снинний — ‘_'| Росинжуиниринг — Автоматизация Формат АЗ
А Снинний — ‘_'| Росинжуиниринг — Автоматизация Формат АЗ
|| — ) Росинжиниринг Формат ЗА4х?
) Росинжиниринг ПоМОт: АЗ
Росинжиниринг та ‘ Проект
=Т ° Росинжуниринг — : Проект
«н - Росинжиниринг == — Проект
/ 7 - Росинжи НнЧрчнг Проект Формат АЗ
—” Росинжинуринг ‘== — Проект Формат АЗх3
'=_|| Росунжиниринг —— Проект""".split("\n")

geo = """«> | еОИВОЛПРОЕКТ №02.2-2009-7013441822-И-087 
1 ©. «> 1 еОИВОЛПРОЕКТ СР0-1П-067-15122009 Формот
«> 1 еОИВОЛПРОЕКТ СР0-1П-067-15122009 Формат АЗ
ГЕОИВОЛ"ПРОЕКТ №002.3-2009- 761344 1822-П-0В7 Фопмет 7
00 1ЕС СР0-1-087-15122009 Формат А'
ООО Г ЕОИЗОЛ 22 5— 7004078? 3441822- П- Э6. А
«> 1 еОИВОЛПРОЕКТ №02.2-2009- 781344 1622-И-087 Формот А2
и О’ОО «> 1 ЕОИВОЛ`ПРОЕКТ СР0-1-087-15122009 Формат Ах
600 «> 1 еОИВОЛ"ПРОЕКТ СРО-П-087-15122009 Формат А2
ООО «ГЕОИЗОЛ Проект»
«> 1 ЕеОИВОЛ`ПРОЕКТ СРО-П-087-15122009 Формат 594х29 7
«> 1 ЕОИВОЛПРОЕКТ №02.2-2009- 781344 1822-1-087 Формат АЗх.3
«> 1 еОИВОЛ`ПРОЕКТ СРО-П-087-15122009 Формат о94х2 9/
600 › | еОИВОЛ`ПРОЕКТ №002.2-2009-78 1344 1622-1-067 Формот А2
«> еОИВОЛПРОЕКТ СРО-П-087-15122009 Формат А2
600 › | еОИВОЛ`ПРОЕКТ №002.2-2009-78 1344 1622-1-067 Формаот — А2
«» ГЕОИВОЛПРОЕКТ №002.3-2009- 761344 1822-П-0В7 Фопмет А2
«> 1 ЕеОИВОЛ`ПРОЕКТ СРО-П-087-15122009 Формат 594х29 7
” 600 «> 1 ЕОИВОЛ`ПРОЕКТ СР0-1-087-15122009 Формат Ах
—<` і —|` Е — \ Росинжиниринг Автоматизация Формат А&х3
600 › | еОИВОЛ`ПРОЕКТ №002.2-2009-78 1344 1622-1-067 Формот А2
” 600 «> 1 ЕОИВОЛ`ПРОЕКТ СР0-1-087-15122009 Формат Ах
«> ГЕОИВОЛ°ПРОЕКТ №02.2-2009-701344 18221087 Формат АЗх.
«> ГЕОИВОЛ°ПРОЕКТ №02.2-2009-701344 18221087 Формат АЗх.
— ООО › | еОИВОЛ`ПРОЕКТ №002.2-2009-78 1344 1622-1-067 Формот _ А2
600 › | еОИВОЛ`ПРОЕКТ №002.2-2009-78 1344 1622-1-067 Формаот — А2
«> 1 еОИВОЛПРОЕКТ СР0-1П-067-15122009 Формат АЗ
«> еОИВОЛПРОЕКТ СРО-П-087-15122009 Формат А2
600 › | еОИВОЛ`ПРОЕКТ №002.2-2009-78 1344 1622-1-067 Формот А2
«> | ЕОИВОЛ'ПРОЕКТ №02.5-2009-7613441822-11-087 А7
/ 600 «> 1 ЕОИВОЛ`ПРОЕКТ СР0-1-087-15122009 Формат Ах
Ц 600 «> | ЕОИВОЛ`ПРОЕКТ СР0-П-067-15122009 Формат А
ООО 1 еОИВОЛ ПРОЕКТ №02.5-2009-7813441622-И-087 А2
«> 1 ЕеОИВОЛ`ПРОЕКТ СРО-П-087-15122009 Формат о94х29 /
«> ЕеОИВОЛПРОЕКТ СРО-П-087-15122009 Формат А2
600 › | еОИВОЛ`ПРОЕКТ №002.2-2009-78 1344 1622-1-067 Формот А2
«> ГЕОИВОЛ°ПРОЕКТ №02.2-2009-701344 18221087 Формат АЗх.
ГЕОИВОЛ"ПРОЕКТ №002.3-2009- 761344 1822-П-0В7 Фопмет 7
” 600 «> 1 ЕОИВОЛ`ПРОЕКТ СР0-1-087-15122009 Формат А2
002 5-2009- 781346 1622-11-067 000 ГЕОИЗОЙ Ироект” Формат АЗх.""".split("\n")

inst_check = {"ООО «Эвотэк энерго»": evo,
              "ООО “Газпром проектирование” Саротовский филиал": gasprom_sar,
              "Гипрогазцентр": gipro,
              "Газпром проектирование": gasprom,
              "ПАО «ВНИПИгаздобыча»": vnipi,
              "000 ПИ ОСН": piosn,
              "Росинжиниринг проект": rosin,
              "Росинжиниринг Автоматизация": rosinauto,
              "Росинжиниринг": ["Росинжиниринг"],
              "ООО ПетроМоделинг Груп": ["ООО ПетроМоделинг Груп"],
              "ООО «ГЕОИЗОЛ Проект»": geo,
              "ООО «АК «АэроТех»": aero,
              "АЛЬФАПРОЕКТ": ["АЛЬФАПРОЕКТ"]}

def fineins(data):
    if "inst" in data:
        inst = data["inst"]
        inst = re.sub("(((Ф|ф)о(т|р)(ма|лие)(т|тт))? А(4|2|3|А|\\?|1КЗ|Зх4))|(улимлат АЛ)", "", inst)
        retinst = inst
        inst = re.sub(tmp1conf["titular"]["documentCipher"]["reg"], "", inst)
        inst = re.sub("\W+", '', inst)
        rin = {}
        for inst_var in inst_check:
            for exam in inst_check[inst_var]:
                exam = re.sub("(((Ф|ф)о(т|р)(ма|лие)(т|тт))? А(4|2|3|А|\\?|1КЗ|Зх4))|(улимлат АЛ)", "", exam)
                exam = re.sub(tmp1conf["titular"]["documentCipher"]["reg"], "", exam)
                exam = re.sub('\W+', '', exam)
                dis=distance(inst.replace("|",""), exam.replace("|",""))
                if inst_var in rin and rin[inst_var] > dis:
                    rin[inst_var] = dis
                elif inst_var not in rin:
                    rin[inst_var] = dis
        print(min(rin.values()))
        if min(rin.values()) <7:
            return min(rin, key=rin.get)
        else:
            return retinst
    else:
        return ""

# with open("tmp3_rersult_stamp.json", "r") as json_file:
#     res = json.load(json_file)
#
# for i in res:
#     if "inst" in res[i]:
#         # print(i)
#         print(fineins(res[i]))
#         print(res[i]["inst"])
#         print()